let name01:string = '张三';

(()=>{
    var name02:string = '李四';
    console.log('全局变量，可在任意位置调用：', name01);
    console.log('局部变量，仅在函数内部（局部）调用：', name02);
})();

// ▼报错：（局部变量，可在全局环境无法调用）
// console.log(name02);

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// ▼ 用{}创造局部作用域
{
    var name03 = '王五'; //用var声明的变量会泄露，在局部以外可以调用
    let name04 = '赵六'; //用let声明的变量不会泄露，
}
console.log( name03 ); //正常调用
// console.log( name04 ); //报错

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------

(()=>{
    var name05 = 'Tom';
    let name06 = 'Jack';
})();

// console.log( name05 ); //报错调用
// console.log( name06 ); //报错调用

